:- use_module(library(lists)).

ῥίζα(παιδεύ).
ῥίζα(γράφ).
ῥίζα(ἐθέλ).
ῥίζα(θύ).
ῥίζα(κλέπτ).
ῥίζα(σπεύδ).
ῥίζα(φυλάττ).

ω-τέλος(πρῶτον, ἐνεστώς, ω).
ω-τέλος(δεύτερον, ἐνεστώς, εις).
ω-τέλος(τρίτον, ἐνεστώς, ει).
ω-τέλος(πρῶτον, πληθυντικός, ομεν).
ω-τέλος(δεύτερον, πληθυντικός, ετε).
ω-τέλος(τρίτον, πληθυντικός, ουσι).
ω-τέλος(τρίτον, πληθυντικός, ουσιν).

ω-τέλος-προστακτική(δεύτερον, ἐνεστώς, ω).


ῥῆμα(Ψ, Φ, Η, Ω):-
  ῥίζα(Ψ),
  ω-τέλος(Φ, Η, Τ),
  atom_chars(Τ, Ζ),
  atom_chars(Ψ, Ε),
  append(Ε, Ζ, Ω).